<?php

if (!defined('BB_ROOT')) die(basename(__FILE__));

$announce_urls = array();

// Здесь вы можете указать дополнительные разрешенные URL-адреса анонсеров в случае наличия которых
// внутри торрента, торрент будет допущен к регистрации на трекере
// =====================================================================================================================
// Например, если вы хотите добавить 'http://demo.torrentpier.com' (или любой другой сайт на движке TorrentPier)
// в список допущенных для регистрации, то добавьте эту строку: $announce_urls[] = 'http://demo.torrentpier.com/bt/announce.php';
// =====================================================================================================================
// Если сайт который вы хотите добавить использует другой анонсер, то вам необходимо знать полный
// URL-адрес, например очень часто анонсеры имеют примерно такой
// формат URL-адреса: 'http://tracker.openbittorrent.com:80/announce' или
// например: 'udp://tracker.openbittorrent.com:6969/announce'
// =====================================================================================================================
// Важно, добавляйте URL-адреса без GET параметров в конце
// Примечание: для работы этого файла нужно в админ-панели в "Настройки форумов" включить опцию "Проверять announce url"

// $announce_urls[] = 'http://demo.torrentpier.com/bt/announce.php';
// $announce_urls[] = 'http://tracker.openbittorrent.com:80/announce';
// $announce_urls[] = 'udp://tracker.openbittorrent.com:6969/announce';
